import {
  BrainIcon,
  BusIcon,
  CarIcon,
  CarTaxiFrontIcon,
  ChartLineIcon,
  DollarIcon,
  PlaneIcon,
  PrinterIcon,
  RibbonIcon,
  SecurityIcon,
  WaypointsIcon,
} from '@/components/shared/icons';
import { ReactNode } from 'react';
const ICON_SIZE = 36;
type Service = {
  id: number;
  title: string;
  icon: ReactNode;
  description: string;
};
export const EVENT_MANAGEMENT_SERVICES: Service[] = [
  {
    id: 1,
    title: 'التخطيـــط الاستراتيجي',
    icon: <ChartLineIcon size={ICON_SIZE} />,
    description:
      'نبدأ بتحليـــــــل متطلبــات الحــــــــــــدث وأهدافـــــــه والجمهــور المســـتهدف. وبناء عليه، نقــوم بوضــع استراتيجية شاملـــــة للمواعيـــــــــد والأهــــــــــداف والميزانية والتصميـــــم والتسويـــــــق وغيرها من العوامل المهمة.',
  },
  {
    id: 2,
    title: 'التصميم الإبداعي',
    icon: <BrainIcon size={ICON_SIZE} />,
    description:
      'بعد مشاركة الخطط والاستراتيجيات نبدأ في إعداد التصميمات الإبداعية للفعاليات باستخدام أحدث التقنيات وأكثر الخبراء إطلاعًا على أحدث الطرز التصميمية العالمية، وكيفية دمج تلك التحديثات مع ثقافة الفعالية أو الحدث.',
  },
  {
    id: 3,
    title: 'إدارة الموارد والميزانية',
    icon: <DollarIcon size={ICON_SIZE} />,
    description:
      'نحن ندير الميزانية المخصصة للحدث بعناية، ونقوم بتخطيط ومراقبة  التكاليف والنفقات بدقة. نحن نحرص على استخدام الموارد المتاحة بكفاءة وفعالية.',
  },
  {
    id: 4,
    title: 'التنسيق والتنظيم',
    icon: <WaypointsIcon size={ICON_SIZE} />,
    description:
      'نقوم في هذه المرحلة بإدارة جميـــع جوانب الحدث، بـــدءً من حجز الموقـــع وإدارة الموردين  وتنظيـــم جدول الفعاليات وإدارة البرامج والعروض الفرعية. نحن نعمل على توفري تجربة سلســـة  ومنسقة للمشاركين والحضور.',
  },
  {
    id: 5,
    title: 'الجودة والتفتيش',
    icon: <RibbonIcon size={ICON_SIZE} />,
    description:
      'نحـــن نضمن جودة عالية في جميع جوانب الحدث، بدءً من جودة الخدمات  وصولاً إلى جودة العروض والمحتـــــــــــوى المقـــــــــــدم. نقـــــــوم بالتفتيـــش الدوري وإدارة  المراجعات لضمان الجودة المطلوبة.',
  },
  {
    id: 6,
    title: 'السلامة والأمان',
    icon: <SecurityIcon size={ICON_SIZE} />,
    description:
      'نحن نولي أهمية كبرية لسلامة وأمان المشـــاركني والحضور. نحن نضمن تنفيذ  إجراءات السلامة المناســـبة، مبا في ذلك إدارة المخاطر وتوفري فرق الإسعافات الأولية والتأمني  اللازم.',
  },
];

const ICON_CLASSNAME =
  'size-[40px] text-primary duration-500 group-hover:scale-125';
export const LOGISTICS: Service[] = [
  {
    id: 1,
    title: 'خدمات الحجز والسفر',
    description: `نحن نوفر خدمات حجز الفنادق والسفر لضمان تجربة مريحة وسهلة للحضور.
حجز الفنادق 
 النقل والســـفر 
 ترتيبات إضافية
 الدعم اللوجستي`,
    icon: <PlaneIcon className={ICON_CLASSNAME} />,
  },
  {
    id: 2,
    title: 'المطبوعات',
    description: `ونوفر أيضاً جميع المطبوعات والهدايا اللازمة للفعاليات بأعلى جودة وبتصميم خبير يحافظ على هوية الفعالية ومظهرها اللائق.`,
    icon: <PrinterIcon className={ICON_CLASSNAME} />,
  },
  {
    id: 3,
    title: 'صف السيارات',
    description: `خدمة صف الســـيارات في الحدث تهدف إلى تســـهيل وتنظيم وصول الحضور بسياراتهم وتوفير  تجربة مريحة لهم
تخطيط وتنظيم المواقف
خدمات استلام وتسليم السيارات
تأمين وحامية السيارات
خدمات النقل الداخل`,
    icon: <CarIcon className={ICON_CLASSNAME} />,
  },
  {
    id: 4,
    title: ' المواصلات',
    description: `خدمة مخصصة لنقل الضيوف والحضور من وإلى الأماكن المحددة أثناء الفعاليات بمختلف أنواع الموصلات وفريق من السائقين المحترفين.`,
    icon: <CarTaxiFrontIcon className={ICON_CLASSNAME} />,
  },
  {
    id: 5,
    title: ' شحن اللوازم',
    description: `شحن وتوصيل لوازم الفعاليات المختلفة وضمان تنظيم عملية النقل بشكل سلس وسريع بسيارات الشحن المختلفة.`,
    icon: <BusIcon className={ICON_CLASSNAME} />,
  },
];

export const VISIONS: { title: string; description: string }[] = [
  {
    title: 'التميز (Exellence)',
    description: 'تنظيم الأحداث والمؤتمرات من خلال تقديم تجارب مبهرة لا تُنسى.',
  },
  {
    title: 'المشاركة (Engagement)',
    description: 'طريقة تفاعلية تترك أثراً عميقاً وتحقق الأهداف المرجوة.',
  },
  {
    title: 'التمكين (Empowerment)',
    description:
      'تحقيق رؤية عملائنا وتحويلها إلى واقع ملموس عبر التخطيط والتنفيذ المتقن.',
  },
  {
    title: 'الكفاءة (Efficiency)',
    description:
      'تقديم خدماتنا بأعلى مستويات الكفاءة والاحترافية لتحقيق أعلى التوقعات الممكنة.',
  },
  {
    title: 'التطور (Evolution)',
    description: 'التحسين المستمر في الخدمات ومواكبة أفضل التقنيات والمستجدات',
  },
];

export const MANAGEMENT_SERVICES: {
  img: string;
  title: string;
  description: string;
}[] = [
  {
    img: '/1.webp',
    title: 'إدارة الحشود',
    description:
      'نوفر المنظــمين المــدربين على اســتخدام الأجهزة اللاسلكية و الأكــواد المعتمــدة  لاســتخدامها في تنظيم الحشود وإدارة المواقف المختلفة.',
  },
  {
    img: '/2.webp',
    title: 'تصميم الموقع',
    description:
      'لدينا خدمة مميزة في تصميم موقع الحدث وإضفاء هوية الحدث على كل تفاصيل التصميم ومراعاة تنسيق المساحات أماكن ومساحات العروض المرئية والأنظمة السمعية.',
  },
  {
    img: '/3.webp',
    title: 'الضيافة',
    description:
      ' نقـــوم بتخطيط قوائم الطعـــام وفقًا لاحتياجات الحدث وتفضيلات العـــملاء. يتم اختيار الأطباق  والمأكولات المناسبة للمناسبة ونوع الحدث. ثم نوفر فريق ضيافة محترف لتقديم خدمة عالية الجودة.',
  },
  {
    img: '/4.webp',
    title: 'تنظيم البرامج الفرعية',
    description:
      'نحن نقوم بتنظيم برامج وفعاليات فرعية مصاحبة للحدث أو  المعرض ، مثل المحـــاضرات وورش العمل والعروض التوضيحيــــــة والعـــروض الترفيهية. نهدف إلى توفير تجربـــة شاملة ومتنوعة للحضور.',
  },
];
