import {
  BrainIcon,
  ChartLineIcon,
  DollarIcon,
  RibbonIcon,
  SecurityIcon,
  WaypointsIcon,
} from '@/components/shared/icons';
import { ReactNode } from 'react';
const ICON_SIZE = 36;
export const SERVICES: {
  title: string;
  icon: ReactNode;
  description: string;
}[] = [
  {
    title: 'التخطيـــط الاستراتيجي',
    icon: <ChartLineIcon size={ICON_SIZE} />,
    description:
      'نبدأ بتحليـــــــل متطلبــات الحــــــــــــدث وأهدافـــــــه والجمهــور المســـتهدف. وبناء عليه، نقــوم بوضــع استراتيجية شاملـــــة للمواعيـــــــــد والأهــــــــــداف والميزانية والتصميـــــم والتسويـــــــق وغيرها من العوامل المهمة.',
  },
  {
    title: 'التصميم الإبداعي',
    icon: <BrainIcon size={ICON_SIZE} />,
    description:
      'بعد مشاركة الخطط والاستراتيجيات نبدأ في إعداد التصميمات الإبداعية للفعاليات باستخدام أحدث التقنيات وأكثر الخبراء إطلاعًا على أحدث الطرز التصميمية العالمية، وكيفية دمج تلك التحديثات مع ثقافة الفعالية أو الحدث.',
  },
  {
    title: 'إدارة الموارد والميزانية',
    icon: <DollarIcon size={ICON_SIZE} />,
    description:
      'نحن ندير الميزانية المخصصة للحدث بعناية، ونقوم بتخطيط ومراقبة  التكاليف والنفقات بدقة. نحن نحرص على استخدام الموارد المتاحة بكفاءة وفعالية.',
  },
  {
    title: 'التنسيق والتنظيم',
    icon: <WaypointsIcon size={ICON_SIZE} />,
    description:
      'نقوم في هذه المرحلة بإدارة جميـــع جوانب الحدث، بـــدءً من حجز الموقـــع وإدارة الموردين  وتنظيـــم جدول الفعاليات وإدارة البرامج والعروض الفرعية. نحن نعمل على توفري تجربة سلســـة  ومنسقة للمشاركين والحضور.',
  },
  {
    title: 'الجودة والتفتيش',
    icon: <RibbonIcon size={ICON_SIZE} />,
    description:
      'نحـــن نضمن جودة عالية في جميع جوانب الحدث، بدءً من جودة الخدمات  وصولاً إلى جودة العروض والمحتـــــــــــوى المقـــــــــــدم. نقـــــــوم بالتفتيـــش الدوري وإدارة  المراجعات لضمان الجودة المطلوبة.',
  },
  {
    title: 'السلامة والأمان',
    icon: <SecurityIcon size={ICON_SIZE} />,
    description:
      'نحن نولي أهمية كبرية لسلامة وأمان المشـــاركني والحضور. نحن نضمن تنفيذ  إجراءات السلامة المناســـبة، مبا في ذلك إدارة المخاطر وتوفري فرق الإسعافات الأولية والتأمني  اللازم.',
  },
];
